src/development-environment-with-nix-flakes/main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="Japanese" xml:lang="Japanese">
<head>
<!-- 2025-03-05 Wed 16:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nix flakesのすすめ</title>
<meta name="author" content="haruki7049" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Nix flakesのすすめ</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb82b6b7">1. はじめに</a></li>
<li><a href="#org1f5f0fd">2. とりあえずNix flakesに触れてみる</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb82b6b7" class="outline-2">
<h2 id="orgb82b6b7"><span class="section-number-2">1.</span> はじめに</h2>
<div class="outline-text-2" id="text-1">
<p>
この本を手に取ってくださりありがとうございます。この本は、Nix
flakesをいかに活用するかを例示する本となっています。不明点があった場合は私のメールアドレス、 <code>tontonkirikiri@gmail.com</code> に気軽に連絡してください。この本はGitHubにて管理されているため、リポジトリにイシューを立てていただいても構いません。
</p>

<p>
この本の読者の対象を以下に書きます。
</p>
<ul class="org-ul">
<li>レガシーNix<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>のコマンド体系をある程度理解している人。</li>
<li>Nix式をある程度読める人<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>。</li>
</ul>

<p>
逆に以下のような人々は対象ではありません。
</p>
<ul class="org-ul">
<li>Nixライブラリの実装を深く読んで理解したい人。この本は、Nix flakesをとりあえず使えるようになるためのものなので、flake-utilsの実装などは読みません。</li>
<li>Nix式がうまく読めない人。この本ではNix flakesのためのNix式がたんまり登場します<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>。</li>
</ul>

<p>
初めて書く本なので拙い部分もあるかと思いますが、よろしくお願いします。
</p>
</div>
</div>

<div id="outline-container-org1f5f0fd" class="outline-2">
<h2 id="org1f5f0fd"><span class="section-number-2">2.</span> とりあえずNix flakesに触れてみる</h2>
<div class="outline-text-2" id="text-2">
<p>
Nix flakesは、 <code>Nix-v2.4</code> にて初めて実装されており、それ以降現在のリリースである <code>Nix-v2.24.11</code> にも実装されている機能です。この機能は未だに試験的機能<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>としてマークされていますが、デファクトスタンダードとして広くNixユーザーに使用されています。
</p>

<blockquote>
<p>
フレークは、Nixベースのプロジェクトを、より発見しやすく、構成可能で、一貫性があり、再現可能な方法でパッケージ化するための新しいフォーマットです。フレークは、他のフレークとの依存関係を指定し、パッケージ、Nixpkgsオーバーレイ、NixOSモジュール、CIテストなどのNixアセットを返すflake.nixという名前のファイルを含むリポジトリまたはtarボールです。例えば、 <code>nix run nixpkgs\#hello</code> のようなコマンドは、nixpkgsフレークからhelloアプリケーションを実行します。
フレークは現在実験的とされている。導入については、このブログ記事を参照してください。フレークのシンタックスとセマンティクスの詳細については、nix flakeマニュアル・ページを参照してください。
</p>

<p>
&#x2013; <a href="https://nix.dev/manual/nix/2.25/release-notes/rl-2.4.html%E3%82%88%E3%82%8ADeepL%E7%BF%BB%E8%A8%B3">https://nix.dev/manual/nix/2.25/release-notes/rl-2.4.html%E3%82%88%E3%82%8ADeepL%E7%BF%BB%E8%A8%B3</a>
</p>
</blockquote>

<p>
前提情報はこのくらいですので、一旦Nixが使える状態にしましょう。個人的に、非Nixユーザーから最も簡単なNixの試用方法は、Docker経由での試用が一番だと思っていますので、今回はDockerから試してみましょう。以下のBashコマンドを実行してください。
</p>

<div class="org-src-container">
<pre class="src src-sh"># この本はNixの本だから、Dockerのインストールの解説はしないよ〜
# Googleとかで検索すれば多分でてくると思うよ
docker run -it nixos/nix
</pre>
</div>

<p>
このDockerイメージはかなりのレイヤー数を保持しているので、Dockerイメージダウンロードには時間がかかると思います。
</p>

<p>
Bashプロンプトが表示されたら、以下のコマンド群を入力して試してみましょう。しっかりバージョンが表示され、PATHが通っていることが確認できると思います。
</p>

<div class="org-src-container">
<pre class="src src-sh">nix-shell --version # Nix flakesじゃない方
nix-build --version # Nix flakesじゃない方
nix --version # Nix flakesな方
</pre>
</div>

<p>
Nix flakesでは、 <code>nix</code> というコマンドを主に使います。このコマンドにはサブコマンドがたくさん用意されています。 <code>man nix</code> で検索してみましょう。
</p>

<div class="org-src-container">
<pre class="src src-sh"># よく使うサブコマンドのリスト
# 筆者はこんな辺りをよく使う
# 試しに"nix build"と打ってみよう。
# ちゃんとサブコマンドが認識されていることがわかるはず。
nix build
nix develop
nix shell
nix repl
nix flake
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
ここでは、 <code>nix-shell</code> や <code>nix-build</code> などのコマンド体系を持ち、 <code>default.nix</code> や <code>shell.nix</code> のファイルを取り扱う、通常のNixのことを指す。
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<code>Derivation</code> や <code>pkgs.callPackage</code> を理解しているくらいのレベル感を想定。
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">それでも読みたいなら、スパルタな気分でお読みください。</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
翻訳元: experimental features
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: haruki7049</p>
<p class="date">Created: 2025-03-05 Wed 16:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
